#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_4CCEAAC14EAF74F966EDBB859A80ABE9
struct UFortnite_Base_Cape_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_4CCEAAC14EAF74F966EDBB859A80ABE9_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_TwoWayBlend_640CBD5F435AC99BD210AAB58BC815C7
struct UFortnite_Base_Cape_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_TwoWayBlend_640CBD5F435AC99BD210AAB58BC815C7_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.BlueprintUpdateAnimation
struct UFortnite_Base_Cape_AnimBlueprint_C_BlueprintUpdateAnimation_Params
{
public:
	float                                        DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.BlueprintInitializeAnimation
struct UFortnite_Base_Cape_AnimBlueprint_C_BlueprintInitializeAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_ApplyLimits_1AFC3F20464C37DD4A0492B4C57D9CF4
struct UFortnite_Base_Cape_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_ApplyLimits_1AFC3F20464C37DD4A0492B4C57D9CF4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_5B1585254FECEC7AC44968893F0DA484
struct UFortnite_Base_Cape_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_5B1585254FECEC7AC44968893F0DA484_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_05CBBD4E4868A3721F6CC0847186BC9A
struct UFortnite_Base_Cape_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_AnimGraphNode_Trail_05CBBD4E4868A3721F6CC0847186BC9A_Params
{
public:
};

// 0xDB (0xDB - 0x0)
// Function Fortnite_Base_Cape_AnimBlueprint.Fortnite_Base_Cape_AnimBlueprint_C.ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint
struct UFortnite_Base_Cape_AnimBlueprint_C_ExecuteUbergraph_Fortnite_Base_Cape_AnimBlueprint_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue;                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_SelectVector_ReturnValue;                 // 0x8(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_IsClosed_Variable;                       // 0x14(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_45A4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaTimeX;                           // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetOwnerDirection_ReturnValue;            // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Abs_ReturnValue;                          // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x24(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_45A5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_FClamp_ReturnValue;                       // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Conv_FloatToVector_ReturnValue;           // 0x30(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FClamp_ReturnValue1;                      // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorVector_ReturnValue;        // 0x40(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FMin_ReturnValue;                         // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x58(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_MakeVector_ReturnValue;                   // 0x60(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_45A6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClothingSimulationInteractor*         CallFunc_GetClothingSimulationInteractor_ReturnValue; // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClothingSimulationInteractorNv*       K2Node_DynamicCast_AsClothing_Simulation_Interactor_Nv; // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_45A7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x88(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue;              // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_GetActorForwardVector_ReturnValue;        // 0x98(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Add_VectorVector_ReturnValue;             // 0xA4(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue;              // 0xB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_K2_MakePerlinNoiseVectorAndRemap_ReturnValue; // 0xB8(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorVector_ReturnValue1;       // 0xC4(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                             CallFunc_TryGetFortPawn_ReturnValue;               // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsDBNO_ReturnValue;                       // 0xD8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Has_Been_Initd_Variable;                 // 0xD9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0xDA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
