#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_52092C65461ACD18D5B01BB4D030B168
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_52092C65461ACD18D5B01BB4D030B168_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_3901FDBA403543ECE46416A74FF3B63F
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_3901FDBA403543ECE46416A74FF3B63F_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_3203E6D74B4AB9C6F8DFA19343A0AB89
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_3203E6D74B4AB9C6F8DFA19343A0AB89_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_2E6441E24E4C365305E1A1B31A5394A7
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_2E6441E24E4C365305E1A1B31A5394A7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ApplyAdditive_9A1BB2FD4854E063F238FCA0491E7677
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ApplyAdditive_9A1BB2FD4854E063F238FCA0491E7677_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_63834C5345D0E00DDCE48B861E94AB2D
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_63834C5345D0E00DDCE48B861E94AB2D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ApplyAdditive_461003D24DCB3E3C6A0958818BE9102B
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ApplyAdditive_461003D24DCB3E3C6A0958818BE9102B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_CEBCF56443A3BADC9E7FB6B442941B22
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_CEBCF56443A3BADC9E7FB6B442941B22_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_F03B3FE047D1A063A86F0CBE93E6C891
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_F03B3FE047D1A063A86F0CBE93E6C891_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_1843F30F4FA7AF1E0494F8801D7AB020
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_1843F30F4FA7AF1E0494F8801D7AB020_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.BlueprintUpdateAnimation
struct UM_MED_SRDrift_tier0506_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	float                                        DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_C1978BB04307CD9269E25885CC00FB91
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_C1978BB04307CD9269E25885CC00FB91_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_D33A98C64CF097DC88B4DC89AE6AA2B7
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_D33A98C64CF097DC88B4DC89AE6AA2B7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_1C4B35C34844295DA83A9CB042DF9FF6
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_1C4B35C34844295DA83A9CB042DF9FF6_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_3ADF8BD946835966F1CA26B35D12DCAA
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_3ADF8BD946835966F1CA26B35D12DCAA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_4E5E09D548BBEE0EB413E0AAA285DE7E
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_4E5E09D548BBEE0EB413E0AAA285DE7E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_CopyBone_18D08B7C40A1C309CBD76B877C43327E
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_CopyBone_18D08B7C40A1C309CBD76B877C43327E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_D710E5374D5ADB8E6A1BD48F485D5312
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_D710E5374D5ADB8E6A1BD48F485D5312_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_60A6B2314D6EAF7C6994C9BAAF4D95DC
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_60A6B2314D6EAF7C6994C9BAAF4D95DC_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_F36B21454F10D97C35E06E87B3B7812C
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_F36B21454F10D97C35E06E87B3B7812C_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_42AE03A04827851ACAC81CB3D89F221C
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_42AE03A04827851ACAC81CB3D89F221C_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_4869C6DD4A5CC36B7EF84CAABB4CFEE8
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_4869C6DD4A5CC36B7EF84CAABB4CFEE8_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_5B1B8E0B46D831C904E026B6975FEEFB
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_ModifyBone_5B1B8E0B46D831C904E026B6975FEEFB_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_5773EDAB45A84383634F9C8B1C2C04F6
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_5773EDAB45A84383634F9C8B1C2C04F6_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.BlueprintInitializeAnimation
struct UM_MED_SRDrift_tier0506_AnimBP_C_BlueprintInitializeAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_4E143E2D4A715119040FD68FCD5E408E
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_4E143E2D4A715119040FD68FCD5E408E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_1641822444C2EEB6BCE5DE8DA872FF52
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_PoseByName_1641822444C2EEB6BCE5DE8DA872FF52_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_752267EB49E0FB7E96A433B1BDC1D925
struct UM_MED_SRDrift_tier0506_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_AnimGraphNode_AnimDynamics_752267EB49E0FB7E96A433B1BDC1D925_Params
{
public:
};

// 0x13C (0x13C - 0x0)
// Function M_MED_SRDrift_tier0506_AnimBP.M_MED_SRDrift_tier0506_AnimBP_C.ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP
struct UM_MED_SRDrift_tier0506_AnimBP_C_ExecuteUbergraph_M_MED_SRDrift_tier0506_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Has_Been_Initd_Variable;                 // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38B5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_K2_DirectionBetweenSockets_ReturnValue;   // 0x10(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue; // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue1; // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_DistanceBetweenTwoSocketsAndMapRange_ReturnValue2; // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_IsClosed_Variable;                       // 0x2C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38B6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue;   // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue1;             // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue;                // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue2;             // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Abs_ReturnValue;                          // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue1;               // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FClamp_ReturnValue;                       // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Abs_ReturnValue1;                         // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FClamp_ReturnValue1;                      // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                         CallFunc_MakeRandomStream_ReturnValue;             // 0x68(0x8)(NoDestructor)
	struct FVector                               CallFunc_Conv_FloatToVector_ReturnValue;           // 0x70(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorVector_ReturnValue;        // 0x7C(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x88(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_SelectVector_ReturnValue;                 // 0x90(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_38B7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClothingSimulationInteractor*         CallFunc_GetClothingSimulationInteractor_ReturnValue; // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorVector_ReturnValue1;       // 0xA8(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_38B8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClothingSimulationInteractorNv*       K2Node_DynamicCast_AsClothing_Simulation_Interactor_Nv; // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_SelectVector_ReturnValue1;                // 0xC4(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_X;                            // 0xD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Y;                            // 0xD4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Z;                            // 0xD8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0xDC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue1;  // 0xE0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue2;  // 0xE4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue;                  // 0xE8(0xC)(IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_RInterpTo_ReturnValue;                    // 0xF4(0xC)(IsPlainOldData, NoDestructor)
	float                                        CallFunc_SelectFloat_ReturnValue;                  // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue1;                 // 0x104(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue2;                 // 0x108(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x10C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38BA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x114(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38BB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_SelectFloat_ReturnValue3;                 // 0x118(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue4;                 // 0x11C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_MakeVector_ReturnValue;                   // 0x120(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x12C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_38BC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_SelectFloat_ReturnValue5;                 // 0x130(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue6;                 // 0x134(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SelectFloat_ReturnValue7;                 // 0x138(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
